[
    {
      "bookId": 1,
      "bookName": "SQL Made Easy",
      "author": "Alex Wade",
      "image": "./images/sql.jpg",
      "review": "I've worked in different versions of SQL over the last few decades but my work is not focused on that side of the process anymore. So, it's easy to get rusty. This book was a great refresher on some of the SQL methods and tools I've used in the past to build databases and queries. As someone who already knew SQL, I would expect this book to be a good starting point for people who are new to it.",
      "totalPages": 180,
      "rating": 4.9,
      "category": "Databases & Big Data",
      "tags": [ "SQL", " Data Processing" ],
      "publisher": "Independently published",
      "yearOfPublishing": "March 13, 2024",
      "learningPoints": "Insight into the roaring twenties and the pursuit of wealth.",
      "description": "Set in the Jazz Age, this novel follows the enigmatic Jay Gatsby and his obsession with Daisy Buchanan."
    },
    {
      "bookId": 2,
      "bookName": "The ChatGPT Millionaire",
      "author": " Neil Dagger ",
      "image": "./images/chatGpt.jpg",
      "review": "The ChatGPT Millionaire: 'Making Money Online has never been this EASY' is an absolute game-changer in the realm of online wealth creation. As someone who has explored countless books and resources on this subject, I can confidently say that this book stands head and shoulders above the rest.From the very beginning, the author captivates readers with their clear and concise writing style. They break down complex concepts into easily understandable terms, making it accessible to both beginners and seasoned entrepreneurs. The book is well-structured, providing a step-by-step guide that takes you on a journey towards financial success.",
      "totalPages": 114,
      "rating": 4.2,
      "category": "Human-Computer Interaction",
      "tags": ["Language Processing","AI"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": "January 19, 2023",
      "learningPoints": "Understanding prejudice and compassion.",
      "description": "Set in the Deep South, this novel tells the story of Atticus Finch defending a black man accused of rape."
    },
    {
      "bookId": 3,
      "bookName": "Python for Data Analysis",
      "author": "Wes McKinney",
      "image": "./images/python_data.jpg",
      "review": "I've been using python, pandas and numpy for data analysis for years, and this book does an amazing job of simplifying things and organizing them into logical bite-sized chunks. To be able to simplify libraries that thousands of devs built over decades into a very approachable manual is impressive, well done Wes!",
      "totalPages": 579,
      "rating": 4.5,
      "category": "Technology",
      "tags": [" Data Mining", "Data Processing"],
      "publisher": " O'Reilly Media; 3rd edition",
      "yearOfPublishing": 2022,
      "learningPoints": "Awareness of authoritarian regimes and the erosion of freedom.",
      "description": "Set in a totalitarian society, this novel follows Winston Smith as he rebels against the oppressive regime."
    },
    {
      "bookId": 4,
      "bookName": "Nuclear War A Scenario",
      "author": " Annie Jacobsen",
      "image": "./images/war.jpg",
      "review": "I got this book after seeing Annie on Lex Fridman's podcast, where they discussed the topics in this (and prior) books she has written. I highly recommend watching that podcast, whether or not you read this book.I am not an avid reader at all, but this book had me so glued that I'm about to finish it 24 hours later. I knew a little bit about the topic prior to reading, but now know so much more. It is absolutely terrifying how close to utter annihilation we are. The author does a great job at documenting sources and applying what she has learned in interviews of experts in various fields to lay out a plausible scenario of what might happen when deterrence fails.I don't know if anything can be done by average people about the threat of nuclear annihilation, but this book will wake you up to how serious the subject should be taken.",
      "totalPages": 400 ,
      "rating": 4.3,
      "category": " Nuclear Weapons & Warfare History",
      "tags": ["Security ", " Nuclear Weapons"],
      "publisher": "Dutton",
      "yearOfPublishing": 1024,
      "learningPoints": "Insight into adolescent psychology and societal expectations.",
      "description": "Narrated by Holden Caulfield, this novel follows his experiences in New York City after being expelled from prep school."
    },
    {
      "bookId": 5,
      "bookName": "The Precipice",
      "author": "Toby Ord",
      "image": "./images/principice.jpg",
      "review": "Since the particles of infinity have memory and retain experience, and of the potential of doing the right thing through love, it's possible to simultaneously bind without capturing and support without limiting. Therefore, infinite potential has a constant, which is love, that can ignite a quality and a quantity of these particles.",
      "totalPages":480,
      "rating": 4.3,
      "category": " Natural Disasters",
      "tags": [" Natural Disasters", "Philanthropy"],
      "publisher": " Hachette Books",
      "yearOfPublishing": 2020,
      "learningPoints": "Insight into the social norms and gender roles of Regency-era England.",
      "description": "Follow the spirited Elizabeth Bennet as she navigates the intricacies of love, class, and marriage."
    },
    {
      "bookId": 6,
      "bookName": "The Pragmatic Programmer",
      "author": " David Thomas , Andrew Hunt ",
      "image": "./images/programmer.jpg",
      "review": "I received a copy of the original edition of this book over 20 years ago and immediately used it in my introductory software engineering classes. Hunt and Thomas are skilled practitioners who can both identify key practices of the profession and write about these cogently. The current edition is an updated version, one that brings the material up-to-date without sacrificing any of the key insights from the original. Highly recommended for developers at all levels.",
      "totalPages": 352,
      "rating": 4.6,
      "category": "Software Testing",
      "tags": ["Development", "Software Testing"],
      "publisher": "Addison-Wesley Professional",
      "yearOfPublishing": 2019,
      "learningPoints": "Exploration of heroism and the power of friendship.",
      "description": "Follow Bilbo Baggins as he embarks on a quest to reclaim the Lonely Mountain and its treasure from the dragon Smaug."
    }
]